mitre-cyber-academy/2023-ectf-insecure-example/debug/TM4C123GH6PM.svd
        <register>
          <name>SCGC0</name>
          <description>Sleep Mode Clock Gating Control Register 0</description>
          <addressOffset>0x00000110</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SCGC0_WDT0</name>
              <description>WDT0 Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC0_HIB</name>
              <description>HIB Clock Gating Control</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC0_ADC0</name>
              <description>ADC0 Clock Gating Control</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC0_ADC1</name>
              <description>ADC1 Clock Gating Control</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC0_PWM0</name>
              <description>PWM Clock Gating Control</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC0_CAN0</name>
              <description>CAN0 Clock Gating Control</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC0_CAN1</name>
              <description>CAN1 Clock Gating Control</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC0_WDT1</name>
              <description>WDT1 Clock Gating Control</description>
              <bitRange>[28:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGC1</name>
          <description>Sleep Mode Clock Gating Control Register 1</description>
          <addressOffset>0x00000114</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SCGC1_UART0</name>
              <description>UART0 Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC1_UART1</name>
              <description>UART1 Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC1_UART2</name>
              <description>UART2 Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC1_SSI0</name>
              <description>SSI0 Clock Gating Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC1_SSI1</name>
              <description>SSI1 Clock Gating Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC1_QEI0</name>
              <description>QEI0 Clock Gating Control</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC1_QEI1</name>
              <description>QEI1 Clock Gating Control</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC1_I2C0</name>
              <description>I2C0 Clock Gating Control</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC1_I2C1</name>
              <description>I2C1 Clock Gating Control</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC1_TIMER0</name>
              <description>Timer 0 Clock Gating Control</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC1_TIMER1</name>
              <description>Timer 1 Clock Gating Control</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC1_TIMER2</name>
              <description>Timer 2 Clock Gating Control</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC1_TIMER3</name>
              <description>Timer 3 Clock Gating Control</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC1_COMP0</name>
              <description>Analog Comparator 0 Clock Gating</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC1_COMP1</name>
              <description>Analog Comparator 1 Clock Gating</description>
              <bitRange>[25:25]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGC2</name>
          <description>Sleep Mode Clock Gating Control Register 2</description>
          <addressOffset>0x00000118</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SCGC2_GPIOA</name>
              <description>Port A Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC2_GPIOB</name>
              <description>Port B Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC2_GPIOC</name>
              <description>Port C Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC2_GPIOD</name>
              <description>Port D Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC2_GPIOE</name>
              <description>Port E Clock Gating Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC2_GPIOF</name>
              <description>Port F Clock Gating Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC2_UDMA</name>
              <description>Micro-DMA Clock Gating Control</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC2_USB0</name>
              <description>USB0 Clock Gating Control</description>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGC0</name>
          <description>Deep Sleep Mode Clock Gating Control Register 0</description>
          <addressOffset>0x00000120</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGC0_WDT0</name>
              <description>WDT0 Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC0_HIB</name>
              <description>HIB Clock Gating Control</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC0_ADC0</name>
              <description>ADC0 Clock Gating Control</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC0_ADC1</name>
              <description>ADC1 Clock Gating Control</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC0_PWM0</name>
              <description>PWM Clock Gating Control</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC0_CAN0</name>
              <description>CAN0 Clock Gating Control</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC0_CAN1</name>
              <description>CAN1 Clock Gating Control</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC0_WDT1</name>
              <description>WDT1 Clock Gating Control</description>
              <bitRange>[28:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGC1</name>
          <description>Deep-Sleep Mode Clock Gating Control Register 1</description>
          <addressOffset>0x00000124</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGC1_UART0</name>
              <description>UART0 Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC1_UART1</name>
              <description>UART1 Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC1_UART2</name>
              <description>UART2 Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC1_SSI0</name>
              <description>SSI0 Clock Gating Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC1_SSI1</name>
              <description>SSI1 Clock Gating Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC1_QEI0</name>
              <description>QEI0 Clock Gating Control</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC1_QEI1</name>
              <description>QEI1 Clock Gating Control</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC1_I2C0</name>
              <description>I2C0 Clock Gating Control</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC1_I2C1</name>
              <description>I2C1 Clock Gating Control</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC1_TIMER0</name>
              <description>Timer 0 Clock Gating Control</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC1_TIMER1</name>
              <description>Timer 1 Clock Gating Control</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC1_TIMER2</name>
              <description>Timer 2 Clock Gating Control</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC1_TIMER3</name>
              <description>Timer 3 Clock Gating Control</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC1_COMP0</name>
              <description>Analog Comparator 0 Clock Gating</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC1_COMP1</name>
              <description>Analog Comparator 1 Clock Gating</description>
              <bitRange>[25:25]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGC2</name>
          <description>Deep Sleep Mode Clock Gating Control Register 2</description>
          <addressOffset>0x00000128</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGC2_GPIOA</name>
              <description>Port A Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC2_GPIOB</name>
              <description>Port B Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC2_GPIOC</name>
              <description>Port C Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC2_GPIOD</name>
              <description>Port D Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC2_GPIOE</name>
              <description>Port E Clock Gating Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC2_GPIOF</name>
              <description>Port F Clock Gating Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC2_UDMA</name>
              <description>Micro-DMA Clock Gating Control</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC2_USB0</name>
              <description>USB0 Clock Gating Control</description>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DSLPCLKCFG</name>
          <description>Deep Sleep Clock Configuration</description>
          <addressOffset>0x00000144</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DSLPCLKCFG_O</name>
              <description>Clock Source</description>
              <bitRange>[6:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_O_IGN</name>
                  <description>MOSC</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_O_IO</name>
                  <description>PIOSC</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_O_30</name>
                  <description>30 kHz</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_O_32</name>
                  <description>32.768 kHz</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_DSLPCLKCFG_D</name>
              <description>Divider Field Override</description>
              <bitRange>[28:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSPROP</name>
          <description>System Properties</description>
          <addressOffset>0x0000014C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SYSPROP_FPU</name>
              <description>FPU Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PIOSCCAL</name>
          <description>Precision Internal Oscillator Calibration</description>
          <addressOffset>0x00000150</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PIOSCCAL_UT</name>
              <description>User Trim Value</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PIOSCCAL_UPDATE</name>
              <description>Update Trim</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PIOSCCAL_CAL</name>
              <description>Start Calibration</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PIOSCCAL_UTEN</name>
              <description>Use User Trim Value</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PIOSCSTAT</name>
          <description>Precision Internal Oscillator Statistics</description>
          <addressOffset>0x00000154</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PIOSCSTAT_CT</name>
              <description>Calibration Trim Value</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PIOSCSTAT_CR</name>
              <description>Calibration Result</description>
              <bitRange>[9:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_PIOSCSTAT_CRNONE</name>
                  <description>Calibration has not been attempted</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_PIOSCSTAT_CRPASS</name>
                  <description>The last calibration operation completed to meet 1% accuracy</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_PIOSCSTAT_CRFAIL</name>
                  <description>The last calibration operation failed to meet 1% accuracy</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_PIOSCSTAT_DT</name>
              <description>Default Trim Value</description>
              <bitRange>[22:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PLLFREQ0</name>
          <description>PLL Frequency 0</description>
          <addressOffset>0x00000160</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PLLFREQ0_MINT</name>
              <description>PLL M Integer Value</description>
              <bitRange>[9:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PLLFREQ0_MFRAC</name>
              <description>PLL M Fractional Value</description>
              <bitRange>[19:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PLLFREQ1</name>
          <description>PLL Frequency 1</description>
          <addressOffset>0x00000164</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PLLFREQ1_N</name>
              <description>PLL N Value</description>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PLLFREQ1_Q</name>
              <description>PLL Q Value</description>
              <bitRange>[12:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PLLSTAT</name>
          <description>PLL Status</description>
          <addressOffset>0x00000168</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PLLSTAT_LOCK</name>
              <description>PLL Lock</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DC9</name>
          <description>Device Capabilities 9 ADC Digital Comparators</description>
          <addressOffset>0x00000190</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DC9_ADC0DC0</name>
              <description>ADC0 DC0 Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC0DC1</name>
              <description>ADC0 DC1 Present</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC0DC2</name>
              <description>ADC0 DC2 Present</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC0DC3</name>
              <description>ADC0 DC3 Present</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC0DC4</name>
              <description>ADC0 DC4 Present</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC0DC5</name>
              <description>ADC0 DC5 Present</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC0DC6</name>
              <description>ADC0 DC6 Present</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC0DC7</name>
              <description>ADC0 DC7 Present</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC1DC0</name>
              <description>ADC1 DC0 Present</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC1DC1</name>
              <description>ADC1 DC1 Present</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC1DC2</name>
              <description>ADC1 DC2 Present</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC1DC3</name>
              <description>ADC1 DC3 Present</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC1DC4</name>
              <description>ADC1 DC4 Present</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC1DC5</name>
              <description>ADC1 DC5 Present</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC1DC6</name>
              <description>ADC1 DC6 Present</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC1DC7</name>
              <description>ADC1 DC7 Present</description>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMSTAT</name>
          <description>Non-Volatile Memory Information</description>
          <addressOffset>0x000001A0</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_NVMSTAT_FWB</name>
              <description>32 Word Flash Write Buffer Active</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
